[Killed] Regex
main/components/HelpRequest/HelpRequestForm.js:25:5
 
   // Stryker disable next-line Regex
   const isodate_regex =
-    /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
+    /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[^0-5]\d)/i;
 
   // Email regex
killedBy: HelpRequest tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] Regex
main/components/HelpRequest/HelpRequestForm.js:28:23
     /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
 
   // Email regex
-  const email_regex = /^[\w-\.]+@([\w-]+\.)+[\w-]{2,4}$/i;
+  const email_regex = /^[\w-\.]@([\w-]+\.)+[\w-]{2,4}$/i;
 
   return (
killedBy: HelpRequest tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] Regex
main/components/HelpRequest/HelpRequestForm.js:28:23
     /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
 
   // Email regex
-  const email_regex = /^[\w-\.]+@([\w-]+\.)+[\w-]{2,4}$/i;
+  const email_regex = /^[^\w-\.]+@([\w-]+\.)+[\w-]{2,4}$/i;
 
   return (
killedBy: HelpRequest tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:65:17
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail && "Requester Email is required."}
               {errors.requesterEmail?.type === "pattern" &&
-                "Requester Email must be in the format email@address.ending, e.g. cgaucho@ucsb.edu or pconrad@gmail.com"}
+                ""}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequest tests Correct Error messsages on bad input
statusReason: 
<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] EqualityOperator
main/components/HelpRequest/HelpRequestForm.js:86:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requestTime && "Request Time is required."}
-              {errors.requesterEmail?.type === "pattern" &&
+              {errors.requesterEmail?.type !== "pattern" &&
                 "Request Time must be in the iso-format YYYY-MM-DDTHH:MM"}
             </Form.Control.Feedback>
killedBy: HelpRequest tests renders correctly
statusReason: Error: Found multiple elements with the text: /Request Time/

Here are the matching elements:

<label
  class="form-label"
  for="requestTime"
>

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:86:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requestTime && "Request Time is required."}
-              {errors.requesterEmail?.type === "pattern" &&
-                "Request Time must be in the iso-format YYYY-MM-DDTHH:MM"}
+              {errors.requesterEmail?.type === "pattern" || "Request Time must be in the iso-format YYYY-MM-DDTHH:MM"}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequest tests renders correctly
statusReason: Error: Found multiple elements with the text: /Request Time/

Here are the matching elements:

<label
  class="form-label"
  for="requestTime"
>
