[Killed] BlockStatement
main/components/HelpRequest/HelpRequestTable.js:64:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "HelpRequestTable")
-    );
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "HelpRequestTable")
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: HelpRequestTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:66:28
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "HelpRequestTable")
+      ButtonColumn("Edit", "", editCallback, "HelpRequestTable")
     );
     columns.push(
killedBy: HelpRequestTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:69:56
       ButtonColumn("Edit", "primary", editCallback, "HelpRequestTable")
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "HelpRequestTable")
+      ButtonColumn("Delete", "danger", deleteCallback, "")
     );
   }
killedBy: HelpRequestTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
