[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:34:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="MenuItemReviewForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {true}
 
                 <Col>
killedBy: MenuItemReview tests renders correctly when passing in a MenuItemReview
statusReason: Error: Unable to find an element by: [data-testid="/MenuItemReviewForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:34:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="MenuItemReviewForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {false}
 
                 <Col>
killedBy: MenuItemReview tests renders correctly when passing in a MenuItemReview
statusReason: Error: Unable to find an element by: [data-testid="/MenuItemReviewForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:76:43
                             type="text"
                             isInvalid={Boolean(errors.reviewerEmail)}
                             {...register("reviewerEmail", {  
-                                required: true, pattern: email_regex
+                                required: false, pattern: email_regex
                             })}
                         />
killedBy: MenuItemReview tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:80:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.reviewerEmail && 'Reviewer Email is required. '}
+                            {false}
                             {errors.reviewerEmail?.type === 'pattern' && 'Reviewer email must be a valid email.'}
                         </Form.Control.Feedback>
killedBy: MenuItemReview tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:80:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.reviewerEmail && 'Reviewer Email is required. '}
+                            {errors.reviewerEmail || 'Reviewer Email is required. '}
                             {errors.reviewerEmail?.type === 'pattern' && 'Reviewer email must be a valid email.'}
                         </Form.Control.Feedback>
killedBy: MenuItemReview tests renders correctly
statusReason: Error: Found multiple elements with the text: /Reviewer Email/

Here are the matching elements:

<label
  class="form-label"
  for="reviewerEmail"
>

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:81:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.reviewerEmail && 'Reviewer Email is required. '}
-                            {errors.reviewerEmail?.type === 'pattern' && 'Reviewer email must be a valid email.'}
+                            {errors.reviewerEmail.type === 'pattern' && 'Reviewer email must be a valid email.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReview tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:81:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.reviewerEmail && 'Reviewer Email is required. '}
-                            {errors.reviewerEmail?.type === 'pattern' && 'Reviewer email must be a valid email.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReview tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Reviewer email must be a valid email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:114:70
                             id="dateReviewed"
                             type="datetime-local"
                             isInvalid={Boolean(errors.localDateTime)}
-                            {...register("dateReviewed", { required: true, pattern: isodate_regex })}
+                            {...register("dateReviewed", { required: false, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReview tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Reviewed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:114:42
                             id="dateReviewed"
                             type="datetime-local"
                             isInvalid={Boolean(errors.localDateTime)}
-                            {...register("dateReviewed", { required: true, pattern: isodate_regex })}
+                            {...register("", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReview tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:117:30
                             {...register("dateReviewed", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateReviewed && 'Date Reviewed is required.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReview tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Reviewed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:129:54
                             id="comments"
                             type="text"
                             isInvalid={Boolean(errors.name)}
-                            {...register("comments", {
-                                required: "Comments are required."
-                            })}
+                            {...register("comments", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReview tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
