[Killed] BlockStatement
main/components/MenuItemReview/MenuItemReviewTable.js:13:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/menuitemreview/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/menuitemreview/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:14:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/menuitemreview/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/menuitemreview/edit/1"
Received: ""

Number of calls: 1

<html>

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:47:9
             Header: 'Stars',
             accessor: 'stars',
         },
-        {
-            Header: 'DateReviewed',
-            accessor: 'dateReviewed',
-        },
+        {},
         {
             Header: 'Comments',
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:48:21
             accessor: 'stars',
         },
         {
-            Header: 'DateReviewed',
+            Header: "",
             accessor: 'dateReviewed',
         },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: DateReviewed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/MenuItemReview/MenuItemReviewTable.js:57:45
         }
     ];
 
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "MenuItemReviewTable"));
-    } 
+    if (hasRole(currentUser, "ROLE_ADMIN")) {} 
 
     return <OurTable
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:58:35
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewTable"));
+        columns.push(ButtonColumn("", "primary", editCallback, "MenuItemReviewTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "MenuItemReviewTable"));
     } 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:58:43
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewTable"));
+        columns.push(ButtonColumn("Edit", "", editCallback, "MenuItemReviewTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "MenuItemReviewTable"));
     } 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:59:45
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "MenuItemReviewTable"));
+        columns.push(ButtonColumn("Delete", "", deleteCallback, "MenuItemReviewTable"));
     } 
 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn
