[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewEditPage.js:3:50
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function MenuItemReviewEditPage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Edit page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function MenuItemReviewEditPage() {}
 
killedBy: MenuItemReviewEditPage tests Renders expected content
statusReason: Error: MenuItemReviewEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
