[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:3:52
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function MenuItemReviewCreatePage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function MenuItemReviewCreatePage() {}
 
killedBy: MenuItemReviewCreatePage tests Renders expected content
statusReason: Error: MenuItemReviewCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
