[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:9:31
 
 export default function MenuItemReviewCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (review) => ({
-    url: "/api/menuitemreview/post",
-    method: "POST",
-    params: {
-      itemId: review.itemId,
-      reviewerEmail: review.reviewerEmail,
-      stars: review.stars,
-      dateReviewed: review.dateReviewed,
-      comments: review.comments
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (review) => {
killedBy: MenuItemReviewCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:12:13
   const objectToAxiosParams = (review) => ({
     url: "/api/menuitemreview/post",
     method: "POST",
-    params: {
-      itemId: review.itemId,
-      reviewerEmail: review.reviewerEmail,
-      stars: review.stars,
-      dateReviewed: review.dateReviewed,
-      comments: review.comments
-    }
+    params: {}
   });
 
killedBy: MenuItemReviewCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "comments": "Absolutely disgusting.",
-   "dateReviewed": "2022-01-03T00:00",
