[Killed] BooleanLiteral
main/components/Articles/ArticlesForm.js:112:43
                             type="text"
                             isInvalid={Boolean(errors.email)}
                             {...register("email", {
-                                required: true, pattern:email_regex})}
+                                required: false, pattern:email_regex})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:115:30
                                 required: true, pattern:email_regex})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.email && 'email is required.'}
+                            {errors.email || 'email is required.'}
                             {errors.email?.type === 'pattern' && 'email is wrong format.'}
                         </Form.Control.Feedback>
killedBy: ArticlesForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /email/

Here are the matching elements:

<label
  class="form-label"
  for="email"
>

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:115:30
                                 required: true, pattern:email_regex})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.email && 'email is required.'}
+                            {false}
                             {errors.email?.type === 'pattern' && 'email is wrong format.'}
                         </Form.Control.Feedback>
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:116:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.email && 'email is required.'}
-                            {errors.email?.type === 'pattern' && 'email is wrong format.'}
+                            {errors.email?.type === 'pattern' || 'email is wrong format.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: ArticlesForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /email/

Here are the matching elements:

<label
  class="form-label"
  for="email"
>

[Killed] OptionalChaining
main/components/Articles/ArticlesForm.js:116:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.email && 'email is required.'}
-                            {errors.email?.type === 'pattern' && 'email is wrong format.'}
+                            {errors.email.type === 'pattern' && 'email is wrong format.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: ArticlesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')
