[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:9:31
 
 export default function UCSBDiningCommonsMenuItemsCreatePage({storybook=false}) { 
 
-  const objectToAxiosParams = (UCSBDiningCommonsMenuItem) => ({ // UCSBDiningCommonsMenuItem
-    url: "/api/diningcommonsmenuitem/post",
-    method: "POST",
-    params: {
-     //id: UCSBDiningCommonsMenuItem.id,
-     diningCommonsCode: UCSBDiningCommonsMenuItem.diningCommonsCode,
-     name: UCSBDiningCommonsMenuItem.name,
-     station: UCSBDiningCommonsMenuItem.station
-    }
-  }); 
+  const objectToAxiosParams = () => undefined; 
 
   const onSuccess = (UCSBDiningCommonsMenuItem) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:11:13
 
   const objectToAxiosParams = (UCSBDiningCommonsMenuItem) => ({ // UCSBDiningCommonsMenuItem
     url: "/api/diningcommonsmenuitem/post",
-    method: "POST",
+    method: "",
     params: {
      //id: UCSBDiningCommonsMenuItem.id,
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:12:13
   const objectToAxiosParams = (UCSBDiningCommonsMenuItem) => ({ // UCSBDiningCommonsMenuItem
     url: "/api/diningcommonsmenuitem/post",
     method: "POST",
-    params: {
-     //id: UCSBDiningCommonsMenuItem.id,
-     diningCommonsCode: UCSBDiningCommonsMenuItem.diningCommonsCode,
-     name: UCSBDiningCommonsMenuItem.name,
-     station: UCSBDiningCommonsMenuItem.station
-    }
+    params: {}
   }); 
 
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "diningCommonsCode": "ortega",
-   "name": "Baked Pesto Pasta with Chicken",

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:37:32
     mutation.mutate(data);
   }
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/diningcommonsmenuitem" />
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/diningcommonsmenuitem"}

Number of calls: 0
