[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:15:13
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             [`/api/diningcommonsmenuitem?id=${id}`],
-            {  // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-                method: "GET",
-                url: `/api/diningcommonsmenuitem`,
-                params: {
-                    id
-                }
-            }
+            {}
         );
 
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (UCSBDiningCommonsMenuItem) => ({
-        url: "/api/diningcommonsmenuitem",
-        method: "PUT",
-        params: {
-            id: UCSBDiningCommonsMenuItem.id,
-        },
-        data: {
-            diningCommonsCode: UCSBDiningCommonsMenuItem.diningCommonsCode,
-            name: UCSBDiningCommonsMenuItem.name,
-            station: UCSBDiningCommonsMenuItem.station
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (UCSBDiningCommonsMenuItem) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDiningCommonsMenuItem Updated - id: 1 name: Baked Pesto Pasta with Bacon"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:24:68
             }
         );
 
-    const objectToAxiosPutParams = (UCSBDiningCommonsMenuItem) => ({
-        url: "/api/diningcommonsmenuitem",
-        method: "PUT",
-        params: {
-            id: UCSBDiningCommonsMenuItem.id,
-        },
-        data: {
-            diningCommonsCode: UCSBDiningCommonsMenuItem.diningCommonsCode,
-            name: UCSBDiningCommonsMenuItem.name,
-            station: UCSBDiningCommonsMenuItem.station
-        }
-    });
+    const objectToAxiosPutParams = (UCSBDiningCommonsMenuItem) => ({});
 
     const onSuccess = (UCSBDiningCommonsMenuItem) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDiningCommonsMenuItem Updated - id: 1 name: Baked Pesto Pasta with Bacon"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] LogicalOperator
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:63:21
             <div className="pt-2">
                 <h1>Edit UCSBDiningCommonsMenuItem</h1>
                 {
-                    UCSBDiningCommonsMenuItem && <UCSBDiningCommonsMenuItemsForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={UCSBDiningCommonsMenuItem} />
+                    UCSBDiningCommonsMenuItem || <UCSBDiningCommonsMenuItemsForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={UCSBDiningCommonsMenuItem} />
                 }
             </div>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, diningCommonsCode, name, station}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:63:21
             <div className="pt-2">
                 <h1>Edit UCSBDiningCommonsMenuItem</h1>
                 {
-                    UCSBDiningCommonsMenuItem && <UCSBDiningCommonsMenuItemsForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={UCSBDiningCommonsMenuItem} />
+                    false
                 }
             </div>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
