[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.js:17:35
         useBackend( 
             // Stryker disable next-line all : don't test internal caching of React Query
             ["/api/diningcommonsmenuitem/all"],
-            { method: "GET", url: "/api/diningcommonsmenuitem/all" },
+            { method: "GET", url: "" },
             // Stryker disable next-line all : don't test default value of empty list
             []
killedBy: UCSBDiningCommonsMenuItemIndexPage tests renders three UCSBDiningCommonsMenuItems correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.js:17:23
         useBackend( 
             // Stryker disable next-line all : don't test internal caching of React Query
             ["/api/diningcommonsmenuitem/all"],
-            { method: "GET", url: "/api/diningcommonsmenuitem/all" },
+            { method: "", url: "/api/diningcommonsmenuitem/all" },
             // Stryker disable next-line all : don't test default value of empty list
             []
killedBy: UCSBDiningCommonsMenuItemIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/diningcommonsmenuitem/all"
Received string:    "Error communicating with backend via  on /api/diningcommonsmenuitem/all"
