[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:62:14
           />
           <Form.Control.Feedback type="invalid">
             {errors.requesterEmail && "Requester Email is required."}
-            {errors.requesterEmail?.type === "pattern" &&
-              "Requester Email must be in the format email@address.ending, e.g. cgaucho@ucsb.edu or pconrad@gmail.com"}
+            {true}
           </Form.Control.Feedback>
         </Form.Group>
killedBy: HelpRequest tests Correct Error messsages on bad input
statusReason: 
<body>
  <div>
    <form
      class=""
    >
      <div
