[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:33:49
                         type="text"
                         
                         isInvalid={Boolean(errors.orgCode)} // was originally .name
-                        {...register("orgCode", {
-                            required: "Org Acronym is required.",
-                            maxLength : {
-                                value: 5,
-                                message: "Max length 5 characters"
-                        }
-                    })}
+                        {...register("orgCode", {})}
                     
                     
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Org Acronym is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:34:39
                         
                         isInvalid={Boolean(errors.orgCode)} // was originally .name
                         {...register("orgCode", {
-                            required: "Org Acronym is required.",
+                            required: "",
                             maxLength : {
                                 value: 5,
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Org Acronym is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:83:37
                     isInvalid={Boolean(errors.orgTranslation)}
                     {...register("orgTranslation", {
                         required: "Full Organization Name is required." ,
-                        maxLength : {
-                            value: 50,
-                            message: "Max length 50 characters"
-                        }
+                        maxLength : {}
                     })}
                 />
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 50 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:102:36
                     id="inactive"
                     {...register("inactive")}
                 >
-                    <option value={false}>False</option>
+                    <option value={true}>False</option>
                     <option value={true}>True</option>
                 </Form.Control>
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "false"
Received: ""

[Killed] BooleanLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:103:36
                     {...register("inactive")}
                 >
                     <option value={false}>False</option>
-                    <option value={true}>True</option>
+                    <option value={false}>True</option>
                 </Form.Control>
             </Form.Group>
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "true"
Received: ""
