[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:56:52
                             id="itemId"
                             type="text"
                             isInvalid={Boolean(errors.itemId)}
-                            {...register("itemId", {  
-                                required: "Item ID is required."
-                            })}
+                            {...register("itemId", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReview tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Item ID is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:74:43
                             type="text"
                             isInvalid={Boolean(errors.reviewerEmail)}
                             {...register("reviewerEmail", {  
-                                required: "Reviewer Email is required."
+                                required: ""
                             })}
                         />
killedBy: MenuItemReview tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:90:42
                             id="stars"
                             type="text"
                             isInvalid={Boolean(errors.reviewerEmail)}
-                            {...register("stars", {  
+                            {...register("", {  
                                 required: "Number of stars is required."
                             })}
killedBy: MenuItemReview tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:91:43
                             type="text"
                             isInvalid={Boolean(errors.reviewerEmail)}
                             {...register("stars", {  
-                                required: "Number of stars is required."
+                                required: ""
                             })}
                         />
killedBy: MenuItemReview tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Number of stars is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
